fonecmid-diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафиков/ВКМ_ЗаполнениеГрафиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_ЗаполнениеГрафиков</name>
</mdclass:DataProcessor>

fonecmid-diplom/src/InformationRegisters/ВКМ_ГрафикиРабот/ВКМ_ГрафикиРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикиРабот</name>
  <resources>
    <name>ВКМ_Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_ТипГрафика</name>
    <type>
      <types>CatalogRef.ВКМ_ТипыГрафиков</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафиков/ObjectModule.bsl
Процедура ЗаполнитьГрафик(ВКМ_ДатаНачала, ВКМ_ДатаОкончания, ВКМ_ВыходныеДни, ВКМ_ТипГрафика) Экспорт 
	
	Набор = РегистрыСведений.ВКМ_ГрафикиРабот.СоздатьНаборЗаписей();
	Набор.Отбор.ВКМ_ТипГрафика.Установить(ВКМ_ТипГрафика);
	
	//Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	
	Дат = ВКМ_ДатаНачала;
	Для к = 0 По Набор.Количество()-1 Цикл
		
		Запись = Набор[к];
		Если Запись.ВКМ_Дата < ВКМ_ДатаНачала Тогда
		    Продолжить;
		ИначеЕсли Запись.ВКМ_Дата =Дат Тогда
			Если Найти(ВКМ_ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
				Запись.ВКМ_Значение = 0;
			Иначе	          
				Запись.ВКМ_Значение = 1;
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
		Иначе
			Пока Дат < Мин(Запись.ВКМ_Дата, ВКМ_ДатаОкончания) Цикл
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.ВКМ_ТипГрафика=ВКМ_ТипГрафика;
				НоваяЗапись.ВКМ_Дата = Дат;
				Если Найти(ВКМ_ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					НоваяЗапись.ВКМ_Значение = 0;
				Иначе	          
					НоваяЗапись.ВКМ_Значение = 1;
				КонецЕсли; 
				Дат = Дат + ЧислоСекундВСутках;
			КонецЦикла; 
			Если Запись.ВКМ_Дата > ВКМ_ДатаОкончания Тогда
				Прервать;
			Иначе
				Если Найти(ВКМ_ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					Запись.ВКМ_Значение = 0;
				Иначе	          
					Запись.ВКМ_Значение = 8;
				КонецЕсли;
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
		КонецЕсли; 
	КонецЦикла;
	Набор.Записать();
	
	Пока Дат <= ВКМ_ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.ВКМ_Дата = Дат;
		Запись.ВКМ_ТипГрафика=ВКМ_ТипГрафика;
		Если Найти(ВКМ_ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
			Запись.ВКМ_Значение = 0;
		Иначе	          
			Запись.ВКМ_Значение = 8;
		КонецЕсли; 
		Дат = Дат + ЧислоСекундВСутках;
	КонецЦикла; 
	Набор.Записать();
КонецПроцедуры
